zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_XRDC.h
/*
** ###################################################################
**     Processors:          MCXE32BMLL_cm7_core0
**                          MCXE32BMLL_cm7_core1
**                          MCXE32BMPB_cm7_core0
**                          MCXE32BMPB_cm7_core1
**
**     Version:             rev. 1.0, 2025-07-18
**     Build:               b260625
**
**     Abstract:
**         CMSIS Peripheral Access Layer for XRDC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2024-11-19)
**         Initial version.
**     - rev. 1.0 (2025-07-18)
**         Rev2 RM.
**
** ###################################################################
*/

/*!
 * @file PERI_XRDC.h
 * @version 1.0
 * @date 2025-07-18
 * @brief CMSIS Peripheral Access Layer for XRDC
 *
 * CMSIS Peripheral Access Layer for XRDC
 */

#if !defined(PERI_XRDC_H_)
#define PERI_XRDC_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE32BMLL_cm7_core0) || defined(CPU_MCXE32BMPB_cm7_core0))
#include "MCXE32B_cm7_core0_COMMON.h"
#elif (defined(CPU_MCXE32BMLL_cm7_core1) || defined(CPU_MCXE32BMPB_cm7_core1))
#include "MCXE32B_cm7_core1_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(XRDC_MASTER_T_)
#define XRDC_MASTER_T_
/*!
 * @addtogroup xrdc_mapping
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the XRDC mapping
 *
 * Defines the structure for the XRDC resource collections.
 */

typedef enum _xrdc_master
{
    kXRDC_MasterCM7                 = 0U,          /**< CM7 AXI, AHBP */
    kXRDC_MasterEdma0               = 2U,          /**< EDMA0 AHB */
    kXRDC_MasterEmac                = 4U,          /**< EMAC AHB */
} xrdc_master_t;

/* @} */
#endif /* XRDC_MASTER_T_ */

#if !defined(XRDC_MEM_T_)
#define XRDC_MEM_T_
typedef enum _xrdc_mem
{
    kXRDC_MemMrc0_0                 = 0U,          /**< MRC0 Memory 0 */
    kXRDC_MemMrc0_1                 = 1U,          /**< MRC0 Memory 1 */
    kXRDC_MemMrc0_2                 = 2U,          /**< MRC0 Memory 2 */
    kXRDC_MemMrc0_3                 = 3U,          /**< MRC0 Memory 3 */
    kXRDC_MemMrc0_4                 = 4U,          /**< MRC0 Memory 4 */
    kXRDC_MemMrc0_5                 = 5U,          /**< MRC0 Memory 5 */
    kXRDC_MemMrc0_6                 = 6U,          /**< MRC0 Memory 6 */
    kXRDC_MemMrc0_7                 = 7U,          /**< MRC0 Memory 7 */
    kXRDC_MemMrc0_8                 = 8U,          /**< MRC0 Memory 8 */
    kXRDC_MemMrc0_9                 = 9U,          /**< MRC0 Memory 9 */
    kXRDC_MemMrc0_10                = 10U,         /**< MRC0 Memory 10 */
    kXRDC_MemMrc0_11                = 11U,         /**< MRC0 Memory 11 */
    kXRDC_MemMrc0_12                = 12U,         /**< MRC0 Memory 12 */
    kXRDC_MemMrc0_13                = 13U,         /**< MRC0 Memory 13 */
    kXRDC_MemMrc0_14                = 14U,         /**< MRC0 Memory 14 */
    kXRDC_MemMrc0_15                = 15U,         /**< MRC0 Memory 15 */
    kXRDC_MemMrc1_0                 = 16U,         /**< MRC1 Memory 0 */
    kXRDC_MemMrc1_1                 = 17U,         /**< MRC1 Memory 1 */
    kXRDC_MemMrc1_2                 = 18U,         /**< MRC1 Memory 2 */
    kXRDC_MemMrc1_3                 = 19U,         /**< MRC1 Memory 3 */
    kXRDC_MemMrc1_4                 = 20U,         /**< MRC1 Memory 4 */
    kXRDC_MemMrc1_5                 = 21U,         /**< MRC1 Memory 5 */
    kXRDC_MemMrc1_6                 = 22U,         /**< MRC1 Memory 6 */
    kXRDC_MemMrc1_7                 = 23U,         /**< MRC1 Memory 7 */
    kXRDC_MemMrc1_8                 = 24U,         /**< MRC1 Memory 8 */
    kXRDC_MemMrc1_9                 = 25U,         /**< MRC1 Memory 9 */
    kXRDC_MemMrc1_10                = 26U,         /**< MRC1 Memory 10 */
    kXRDC_MemMrc1_11                = 27U,         /**< MRC1 Memory 11 */
    kXRDC_MemMrc1_12                = 28U,         /**< MRC1 Memory 12 */
    kXRDC_MemMrc1_13                = 29U,         /**< MRC1 Memory 13 */
    kXRDC_MemMrc1_14                = 30U,         /**< MRC1 Memory 14 */
    kXRDC_MemMrc1_15                = 31U,         /**< MRC1 Memory 15 */
    kXRDC_MemMrc2_0                 = 32U,         /**< MRC2 Memory 0 */
    kXRDC_MemMrc2_1                 = 33U,         /**< MRC2 Memory 1 */
    kXRDC_MemMrc2_2                 = 34U,         /**< MRC2 Memory 2 */
    kXRDC_MemMrc2_3                 = 35U,         /**< MRC2 Memory 3 */
} xrdc_mem_t;
#endif /* XRDC_MEM_T_ */

#if !defined(XRDC_PERIPH_T_)
#define XRDC_PERIPH_T_
typedef enum _xrdc_periph
{
    kXRDC_PeriphTrgmux              = 32U,         /**< Trigger Multiplexing Control */
    kXRDC_PeriphBctu                = 33U,         /**< Body Cross Triggering Unit */
    kXRDC_PeriphEmios0              = 34U,         /**< eMIOS 0 */
    kXRDC_PeriphEmios1              = 35U,         /**< eMIOS 1 */
    kXRDC_PeriphEmios2              = 36U,         /**< eMIOS 2 */
    kXRDC_PeriphLcu0                = 38U,         /**< Logic Control Unit 0 */
    kXRDC_PeriphLcu1                = 39U,         /**< Logic Control Unit 1 */
    kXRDC_PeriphAdc0                = 40U,         /**< Analog-to-digital converter 0 */
    kXRDC_PeriphAdc1                = 41U,         /**< Analog-to-digital converter 1 */
    kXRDC_PeriphAdc2                = 42U,         /**< Analog-to-digital converter 2 */
    kXRDC_PeriphPit0                = 44U,         /**< Programmable Interrupt Timer 0 */
    kXRDC_PeriphPit1                = 45U,         /**< Programmable Interrupt Timer 1 */
    kXRDC_PeriphAxbs                = 128U,        /**< System crossbar switch */
    kXRDC_PeriphSystemXbic          = 129U,        /**< Crossbar Integrity Checker (System AXBS / AXBS Lite) */
    kXRDC_PeriphPeriphXbic          = 130U,        /**< Crossbar Integrity Checker (Peripheral AXBS-Lite) */
    kXRDC_PeriphEdma                = 131U,        /**< eDMA control and status (MP_CSR MP_ES MP_HRS) */
    kXRDC_PeriphEdmaTcd0            = 132U,        /**< eDMA transfer control descriptor 0 */
    kXRDC_PeriphEdmaTcd1            = 133U,        /**< eDMA transfer control descriptor 1 */
    kXRDC_PeriphEdmaTcd2            = 134U,        /**< eDMA transfer control descriptor 2 */
    kXRDC_PeriphEdmaTcd3            = 135U,        /**< eDMA transfer control descriptor 3 */
    kXRDC_PeriphEdmaTcd4            = 136U,        /**< eDMA transfer control descriptor 4 */
    kXRDC_PeriphEdmaTcd5            = 137U,        /**< eDMA transfer control descriptor 5 */
    kXRDC_PeriphEdmaTcd6            = 138U,        /**< eDMA transfer control descriptor 6 */
    kXRDC_PeriphEdmaTcd7            = 139U,        /**< eDMA transfer control descriptor 7 */
    kXRDC_PeriphEdmaTcd8            = 140U,        /**< eDMA transfer control descriptor 8 */
    kXRDC_PeriphEdmaTcd9            = 141U,        /**< eDMA transfer control descriptor 9 */
    kXRDC_PeriphEdmaTcd10           = 142U,        /**< eDMA transfer control descriptor 10 */
    kXRDC_PeriphEdmaTcd11           = 143U,        /**< eDMA transfer control descriptor 11 */
    kXRDC_PeriphDebug               = 149U,        /**< Debug APB Area, SDA-AP */
    kXRDC_PeriphEim0                = 150U,        /**< EIM0 */
    kXRDC_PeriphErm0                = 151U,        /**< ERM0 */
    kXRDC_PeriphMscm                = 152U,        /**< MSCM */
    kXRDC_PeriphPram0               = 153U,        /**< RAM controller 0 */
    kXRDC_PeriphPfc                 = 154U,        /**< Flash controller */
    kXRDC_PeriphPfcAlt              = 155U,        /**< Flash controller alternate */
    kXRDC_PeriphSwt0                = 156U,        /**< Software Watchdog 0 */
    kXRDC_PeriphStm0                = 157U,        /**< System Timer Module 0 */
    kXRDC_PeriphXrdc                = 158U,        /**< XRDC */
    kXRDC_PeriphIntm                = 159U,        /**< Interrupt Monitor */
    kXRDC_PeriphDmamux0             = 160U,        /**< DMA Channel Multiplexer 0 */
    kXRDC_PeriphDmamux1             = 161U,        /**< DMA Channel Multiplexer 1 */
    kXRDC_PeriphRtc                 = 162U,        /**< Real-time clock */
    kXRDC_PeriphMc_rgm              = 163U,        /**< Reset Generation Module */
    kXRDC_PeriphSiul2VwrapPdac0_0   = 164U,        /**< SIUL_VIRTWRAPPER_PDAC0 */
    kXRDC_PeriphSiul2VwrapPdac0_1   = 165U,        /**< SIUL_VIRTWRAPPER_PDAC0 */
    kXRDC_PeriphSiul2VwrapPdac1_0   = 166U,        /**< SIUL_VIRTWRAPPER_PDAC1 */
    kXRDC_PeriphSiul2VwrapPdac1_1   = 167U,        /**< SIUL_VIRTWRAPPER_PDAC1 */
    kXRDC_PeriphSiul2VwrapPdac3     = 170U,        /**< SIUL_VIRTWRAPPER_PDAC3 */
    kXRDC_PeriphDcm                 = 171U,        /**< System Status and Configuration Module */
    kXRDC_PeriphWkpu                = 173U,        /**< Wakeup Unit */
    kXRDC_PeriphCmu                 = 175U,        /**< CMU 0-5 */
    kXRDC_PeriphTspc                = 177U,        /**< Touch Sensing Coupling Controller */
    kXRDC_PeriphSirc                = 178U,        /**< 32 kHz Slow Internal RC Oscillator */
    kXRDC_PeriphSxosc               = 179U,        /**< 32 kHz Slow External Crystal Oscillator */
    kXRDC_PeriphFirc                = 180U,        /**< 48 MHz Fast Internal RC Oscillator */
    kXRDC_PeriphFxosc               = 181U,        /**< 8-40 MHz Fast External Crystal Oscillator */
    kXRDC_PeriphMc_cgm              = 182U,        /**< Clock Generation Module */
    kXRDC_PeriphMc_me               = 183U,        /**< Mode Entry Module */
    kXRDC_PeriphPll                 = 184U,        /**< Frequency Modulated Phase-Locked Loop */
    kXRDC_PeriphPmc                 = 186U,        /**< Power management controller */
    kXRDC_PeriphFmu                 = 187U,        /**< Flash memory */
    kXRDC_PeriphFmuAlt              = 188U,        /**< Flash memory alternate */
    kXRDC_PeriphPit2                = 191U,        /**< Programmable Interrupt Timer 2 */
    kXRDC_PeriphFlexcan0            = 193U,        /**< FlexCAN 0 */
    kXRDC_PeriphFlexcan1            = 194U,        /**< FlexCAN 1 */
    kXRDC_PeriphFlexcan2            = 195U,        /**< FlexCAN 2 */
    kXRDC_PeriphFlexcan3            = 196U,        /**< FlexCAN 3 */
    kXRDC_PeriphFlexcan4            = 197U,        /**< FlexCAN 4 */
    kXRDC_PeriphFlexcan5            = 198U,        /**< FlexCAN 5 */
    kXRDC_PeriphFlexio              = 201U,        /**< Flexible IO */
    kXRDC_PeriphLpuart0             = 202U,        /**< Low Power UART 0 */
    kXRDC_PeriphLpuart1             = 203U,        /**< Low Power UART 1 */
    kXRDC_PeriphLpuart2             = 204U,        /**< Low Power UART 2 */
    kXRDC_PeriphLpuart3             = 205U,        /**< Low Power UART 3 */
    kXRDC_PeriphLpuart4             = 206U,        /**< Low Power UART 4 */
    kXRDC_PeriphLpuart5             = 207U,        /**< Low Power UART 5 */
    kXRDC_PeriphLpuart6             = 208U,        /**< Low Power UART 6 */
    kXRDC_PeriphLpuart7             = 209U,        /**< Low Power UART 7 */
    kXRDC_PeriphLpi2c0              = 212U,        /**< Low Power I2C 0 */
    kXRDC_PeriphLpi2c1              = 213U,        /**< Low Power I2C 1 */
    kXRDC_PeriphLpspi0              = 214U,        /**< Low Power SPI 0 */
    kXRDC_PeriphLpspi1              = 215U,        /**< Low Power SPI 1 */
    kXRDC_PeriphLpspi2              = 216U,        /**< Low Power SPI 2 */
    kXRDC_PeriphLpspi3              = 217U,        /**< Low Power SPI 3 */
    kXRDC_PeriphSai0                = 219U,        /**< Synchronous Audio Interface 0 */
    kXRDC_PeriphLpcmp0              = 220U,        /**< Low Power Comparator 0 */
    kXRDC_PeriphLpcmp1              = 221U,        /**< Low Power Comparator 1 */
    kXRDC_PeriphTmu                 = 223U,        /**< TMU Temperature Sensor Unit  */
    kXRDC_PeriphCrc                 = 224U,        /**< CRC */
    kXRDC_PeriphFccu                = 225U,        /**< FCCU (and FOSU) */
    kXRDC_PeriphMu0B                = 227U,        /**< MU_0_MUB */
    kXRDC_PeriphJdc                 = 229U,        /**< JDC (JTAG Data Communication) */
    kXRDC_PeriphConfiguration_gpr   = 231U,        /**< Configuration GPR */
    kXRDC_PeriphStcu                = 232U,        /**< Self-Test Control Unit */
    kXRDC_PeriphSelftest_gpr        = 236U,        /**< Selftest GPR */
    kXRDC_PeriphTcmXbic             = 256U,        /**< Crossbar Integrity Checker (TCM backdoor AHB Splitter) */
    kXRDC_PeriphEdma_xbic           = 257U,        /**< Crossbar Integrity Checker (eDMA and STAM AXBS-Lite) */
    kXRDC_PeriphEdmaTcd12           = 260U,        /**< eDMA transfer control descriptor 12 */
    kXRDC_PeriphEdmaTcd13           = 261U,        /**< eDMA transfer control descriptor 13 */
    kXRDC_PeriphEdmaTcd14           = 262U,        /**< eDMA transfer control descriptor 14 */
    kXRDC_PeriphEdmaTcd15           = 263U,        /**< eDMA transfer control descriptor 15 */
    kXRDC_PeriphEdmaTcd16           = 264U,        /**< eDMA transfer control descriptor 16 */
    kXRDC_PeriphEdmaTcd17           = 265U,        /**< eDMA transfer control descriptor 17 */
    kXRDC_PeriphEdmaTcd18           = 266U,        /**< eDMA transfer control descriptor 18 */
    kXRDC_PeriphEdmaTcd19           = 267U,        /**< eDMA transfer control descriptor 19 */
    kXRDC_PeriphEdmaTcd20           = 268U,        /**< eDMA transfer control descriptor 20 */
    kXRDC_PeriphEdmaTcd21           = 269U,        /**< eDMA transfer control descriptor 21 */
    kXRDC_PeriphEdmaTcd22           = 270U,        /**< eDMA transfer control descriptor 22 */
    kXRDC_PeriphEdmaTcd23           = 271U,        /**< eDMA transfer control descriptor 23 */
    kXRDC_PeriphEdmaTcd24           = 272U,        /**< eDMA transfer control descriptor 24 */
    kXRDC_PeriphEdmaTcd25           = 273U,        /**< eDMA transfer control descriptor 25 */
    kXRDC_PeriphEdmaTcd26           = 274U,        /**< eDMA transfer control descriptor 26 */
    kXRDC_PeriphEdmaTcd27           = 275U,        /**< eDMA transfer control descriptor 27 */
    kXRDC_PeriphEdmaTcd28           = 276U,        /**< eDMA transfer control descriptor 28 */
    kXRDC_PeriphEdmaTcd29           = 277U,        /**< eDMA transfer control descriptor 29 */
    kXRDC_PeriphEdmaTcd30           = 278U,        /**< eDMA transfer control descriptor 30 */
    kXRDC_PeriphEdmaTcd31           = 279U,        /**< eDMA transfer control descriptor 31 */
    kXRDC_PeriphSema42              = 280U,        /**< Semaphores2 */
    kXRDC_PeriphPram1               = 281U,        /**< RAM controller 1 */
    kXRDC_PeriphStm1                = 285U,        /**< System Timer Module 1 */
    kXRDC_PeriphEmac                = 288U,        /**< EMAC */
    kXRDC_PeriphLpuart8             = 291U,        /**< Low Power UART 8 */
    kXRDC_PeriphLpuart9             = 292U,        /**< Low Power UART 9 */
    kXRDC_PeriphLpuart10            = 293U,        /**< Low Power UART 10 */
    kXRDC_PeriphLpuart11            = 294U,        /**< Low Power UART 11 */
    kXRDC_PeriphLpuart12            = 295U,        /**< Low Power UART 12 */
    kXRDC_PeriphLpuart13            = 296U,        /**< Low Power UART 13 */
    kXRDC_PeriphLpuart14            = 297U,        /**< Low Power UART 14 */
    kXRDC_PeriphLpuart15            = 298U,        /**< Low Power UART 15 */
    kXRDC_PeriphLpspi4              = 303U,        /**< Low Power SPI 4 */
    kXRDC_PeriphLpspi5              = 304U,        /**< Low Power SPI 5 */
    kXRDC_PeriphQuadspi             = 307U,        /**< QuadSPI */
    kXRDC_PeriphSai1                = 311U,        /**< Synchronous Audio Interface 1 */
    kXRDC_PeriphLpcmp2              = 314U,        /**< Low Power Comparator 2 */
    kXRDC_PeriphMu1B                = 315U,        /**< MU_1_MUB */
} xrdc_periph_t;
#endif /* XRDC_PERIPH_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


