zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_XRDC.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- XRDC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XRDC_Peripheral_Access_Layer XRDC Peripheral Access Layer
 * @{
 */

/** XRDC - Size of Registers Arrays */
#define XRDC_MDACFG_COUNT                         6u
#define XRDC_MRC_COUNT                            3u
#define XRDC_DERRLOC_COUNT                        3u
#define XRDC_DERR_Wx_COUNT                        19u
#define XRDC_DERR_Wx_DERR_W_COUNT                 4u
#define XRDC_PID_COUNT                            5u
#define XRDC_MDA_MDA_Wx_COUNT                     1u
#define XRDC_MDA_COUNT                            6u
#define XRDC_PDAC_COUNT                           316u
#define XRDC_PDAC_PDAC_Wx_COUNT                   2u
#define XRDC_MRGD_MRGD_Wx_COUNT                   4u
#define XRDC_MRGD_COUNT                           36u

/** XRDC - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR;                                /**< Control, offset: 0x0 */
       uint8_t RESERVED_0[236];
  __I  uint32_t HWCFG0;                            /**< Hardware Configuration 0, offset: 0xF0 */
  __I  uint32_t HWCFG1;                            /**< Hardware Configuration 1, offset: 0xF4 */
  __I  uint32_t HWCFG2;                            /**< Hardware Configuration 2, offset: 0xF8 */
       uint8_t RESERVED_1[4];
  __I  uint8_t MDACFG[XRDC_MDACFG_COUNT];          /**< Master Domain Assignment Configuration, array offset: 0x100, array step: 0x1 */
       uint8_t RESERVED_2[58];
  __I  uint8_t MRCFG[XRDC_MRC_COUNT];              /**< Memory Region Configuration, array offset: 0x140, array step: 0x1 */
       uint8_t RESERVED_3[189];
  __I  uint32_t DERRLOC[XRDC_DERRLOC_COUNT];       /**< Domain Error Location, array offset: 0x200, array step: 0x4 */
       uint8_t RESERVED_4[500];
  __IO uint32_t DERR_W[XRDC_DERR_Wx_COUNT][XRDC_DERR_Wx_DERR_W_COUNT]; /**< Domain Error Word 0..Domain Error Word 3, array offset: 0x400, array step: index*0x10, index2*0x4, valid indices: [0-2, 16-18][0], [0-2, 16-18][1], [0-2, 16-18][3] */
       uint8_t RESERVED_5[464];
  __IO uint32_t PID[XRDC_PID_COUNT];               /**< Process Identifier, array offset: 0x700, array step: 0x4, valid indices: [0, 3-4] */
       uint8_t RESERVED_6[236];
  struct {                                         /* offset: 0x800, array step: 0x20 */
    __IO uint32_t MDA_W[XRDC_MDA_MDA_Wx_COUNT];      /**< Master Domain Assignment, array offset: 0x800, array step: index*0x20, index2*0x4 */
         uint8_t RESERVED_0[28];
  } MDA[XRDC_MDA_COUNT];
       uint8_t RESERVED_7[1856];
  __IO uint32_t PDAC_W[XRDC_PDAC_COUNT][XRDC_PDAC_PDAC_Wx_COUNT]; /**< Peripheral Domain Access Control Word 0..Peripheral Domain Access Control Word 1, array offset: 0x1000, array step: index*0x8, index2*0x4, irregular array, not all indices are valid */
       uint8_t RESERVED_8[1568];
  struct {                                         /* offset: 0x2000, array step: 0x20 */
    __IO uint32_t MRGD_W[XRDC_MRGD_MRGD_Wx_COUNT];   /**< Memory Region Descriptor Word 0..Memory Region Descriptor Word 3, array offset: 0x2000, array step: index*0x20, index2*0x4 */
         uint8_t RESERVED_0[16];
  } MRGD[XRDC_MRGD_COUNT];
} XRDC_Type;

/* ----------------------------------------------------------------------------
   -- XRDC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XRDC_Register_Masks XRDC Register Masks
 * @{
 */

/*! @name CR - Control */
/*! @{ */

#define XRDC_CR_GVLD_MASK                        (0x1U)
#define XRDC_CR_GVLD_SHIFT                       (0U)
/*! GVLD - Global Valid (XRDC Global Enable/Disable)
 *  0b0..Disables
 *  0b1..Enables
 */
#define XRDC_CR_GVLD(x)                          (((uint32_t)(((uint32_t)(x)) << XRDC_CR_GVLD_SHIFT)) & XRDC_CR_GVLD_MASK)

#define XRDC_CR_HRL_MASK                         (0x1EU)
#define XRDC_CR_HRL_SHIFT                        (1U)
/*! HRL - Hardware Revision Level */
#define XRDC_CR_HRL(x)                           (((uint32_t)(((uint32_t)(x)) << XRDC_CR_HRL_SHIFT)) & XRDC_CR_HRL_MASK)

#define XRDC_CR_MRF_MASK                         (0x80U)
#define XRDC_CR_MRF_SHIFT                        (7U)
/*! MRF - Memory Region Format
 *  0b0..Reserved
 *  0b1..SMPU family format
 */
#define XRDC_CR_MRF(x)                           (((uint32_t)(((uint32_t)(x)) << XRDC_CR_MRF_SHIFT)) & XRDC_CR_MRF_MASK)

#define XRDC_CR_VAW_MASK                         (0x100U)
#define XRDC_CR_VAW_SHIFT                        (8U)
/*! VAW - Virtualization Aware
 *  0b0..Not virtualization-aware
 *  0b1..Virtualization-aware
 */
#define XRDC_CR_VAW(x)                           (((uint32_t)(((uint32_t)(x)) << XRDC_CR_VAW_SHIFT)) & XRDC_CR_VAW_MASK)

#define XRDC_CR_LK1_MASK                         (0x40000000U)
#define XRDC_CR_LK1_SHIFT                        (30U)
/*! LK1 - Lock
 *  0b0..No effect
 *  0b0..Unlocked
 *  0b1..Locks
 */
#define XRDC_CR_LK1(x)                           (((uint32_t)(((uint32_t)(x)) << XRDC_CR_LK1_SHIFT)) & XRDC_CR_LK1_MASK)
/*! @} */

/*! @name HWCFG0 - Hardware Configuration 0 */
/*! @{ */

#define XRDC_HWCFG0_NDID_MASK                    (0xFFU)
#define XRDC_HWCFG0_NDID_SHIFT                   (0U)
/*! NDID - Number Of DIDs */
#define XRDC_HWCFG0_NDID(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG0_NDID_SHIFT)) & XRDC_HWCFG0_NDID_MASK)

#define XRDC_HWCFG0_NMSTR_MASK                   (0xFF00U)
#define XRDC_HWCFG0_NMSTR_SHIFT                  (8U)
/*! NMSTR - Number Of Bus Masters */
#define XRDC_HWCFG0_NMSTR(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG0_NMSTR_SHIFT)) & XRDC_HWCFG0_NMSTR_MASK)

#define XRDC_HWCFG0_NMRC_MASK                    (0xFF0000U)
#define XRDC_HWCFG0_NMRC_SHIFT                   (16U)
/*! NMRC - Number of MRCs */
#define XRDC_HWCFG0_NMRC(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG0_NMRC_SHIFT)) & XRDC_HWCFG0_NMRC_MASK)

